int main()
{    /*"x++"為後置式,會算成"x+1", "++x"為前置式,會算成"1+x", 
       "x--"為後置式,會算成"x-1", "--x"為前置式,會算成"-1+x" 
       特別注意,後置式(例如:y++)的加減符號要在式子算完後在加以計算
       前置式則無此限制*/    
    
    int x=7,y=10;             
    y=x++;
    printf("x=%d,y=%d",x,y); //在這裡,由於x++是後置式,所以會將y=x++算成1.y=x 2.x=x+1(因為x++是後置式) 
    x=7,y=10;
    y=++x;
    printf("\nx=%d,y=%d",x,y);//在這裡,由於++x是前置式,所以會將y=++x算成y=1+x(因為++x是前置式) 
    x=7,y=10;
    y=x--;
    printf("\nx=%d,y=%d",x,y);
    x=7,y=10;
    y=--x;
    printf("\nx=%d,y=%d",x,y);
    system("pause");
    return 0;
}
